[
    {
        "id": 1,
        "title": "Android Mobile Phones ",
        "description": " A mobile phone is a portable telephone that can make and receive calls over a radio frequency link while the user is moving within a telephone service area, as opposed to a fixed-location phone. Modern mobile telephone services use a cellular network architecture and therefore mobile telephones are called cellphones in North America.",
        "content": " A handheld mobile radio telephone service was envisioned in the early stages of radio engineering. In 1917, Finnish inventor Eric Tigerstedt filed a patent for a pocket-size folding telephone with a very thin carbon microphone. Early predecessors of cellular phones included analog radio communications from ships and trains. The race to create truly portable telephone devices began after World War II, with developments taking place in many countries. The advances in mobile telephony have been traced in successive generations, starting with the early zeroth-generation (0G) services, such as Bell System's Mobile Telephone Service and its successor, the Improved Mobile Telephone Service. These 0G systems were not cellular, supported few simultaneous calls, and were very expensive. The first handheld cellular mobile phone was demonstrated by John F. Mitchell[11][12] and Martin Cooper of Motorola in 1973, using a handset weighing 2 kilograms (4.4 lb).[2] The first commercial automated cellular network (1G) analog was launched in Japan by Nippon Telegraph and Telephone in 1979. This was followed in 1981 by the simultaneous launch of the Nordic Mobile Telephone (NMT) system in Denmark, Finland, Norway, and Sweden.[13] Several other countries then followed in the early to mid-1980s. These first-generation (1G) systems could support far more simultaneous calls but still used analog cellular technology. In 1983, the DynaTAC 8000x was the first commercially available handheld mobile phone.  In 1991, the second-generation (2G) digital cellular technology was launched in Finland by Radiolinja on the GSM standard. This sparked competition in the sector as the new operators challenged the incumbent 1G network operators. The GSM standard is a European initiative expressed at the CEPT (Conférence Européenne des Postes et Telecommunications, European Postal and Telecommunications conference). The Franco-German R&D cooperation demonstrated the technical feasibility, and in 1987 a Memorandum of Understanding was signed between 13 European countries who agreed to launch a commercial service by 1991. The first version of the GSM (=2G) standard had 6,000 pages. The IEEE and RSE awarded to Thomas Haug and Philippe Dupuis the 2018 James Clerk Maxwell medal for their contributions to the first digital mobile telephone standard.[14] In 2018, the GSM was used by over 5 billion people in over 220 countries. The GSM (2G) has evolved into 3G, 4G and 5G. The standardisation body for GSM started at the CEPT Working Group GSM (Group Special Mobile) in 1982 under the umbrella of CEPT. In 1988, ETSI was established and all CEPT standardization activities were transferred to ETSI. Working Group GSM became Technical Committee GSM. In 1991, it became Technical Committee SMG (Special Mobile Group) when ETSI tasked the committee with UMTS (3G). " ,
        "ImgURL" : "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2022/01/combine-photos-iphonne.jpg" ,
        "subTitle": "History"
    },
    {
        "id": 2,
        "title": "Laptops ",
        "description": " A laptop computer or notebook computer, also known as a laptop or notebook for short, is a small, portable personal computer.Laptops typically have a clamshell form factor with a flat panel screen (usually 11–17 in or 280–430 mm in diagonal size) on the inside of the upper lid and an alphanumeric keyboard",
       "content" : "As the personal computer (PC) became feasible in 1971, the idea of a portable personal computer soon followed. A personal, portable information manipulator was imagined by Alan Kay at Xerox PARC in 1968,[7] and described in his 1972 paper as the Dynabook.[8] The IBM Special Computer APL Machine Portable (SCAMP) was demonstrated in 1973.[9] This prototype was based on the IBM PALM processor.[10] The IBM 5100, the first commercially available portable computer, appeared in September 1975, and was based on the SCAMP prototype.[11] As 8-bit CPU machines became widely accepted, the number of portables increased rapidly. The first laptop-sized notebook computer was the Epson HX-20,[12][13] invented (patented) by Suwa Seikosha's Yukio Yokozawa in July 1980,[14] introduced at the COMDEX computer show in Las Vegas by Japanese company Seiko Epson in 1981,[15][13] and released in July 1982.[13][16] It had an LCD screen, a rechargeable battery, and a calculator-size printer, in a 1.6 kg (3.5 lb) chassis, the size of an A4 notebook.[13] It was described as a laptop and notebook computer in its patent.[14]  The portable micro computer Portal of the French company R2E Micral CCMC officially appeared in September 1980 at the Sicob show in Paris. It was a portable microcomputer designed and marketed by the studies and developments department of R2E Micral at the request of the company CCMC specializing in payroll and accounting. It was based on an Intel 8085 processor, 8-bit, clocked at 2 MHz. It was equipped with a central 64 KB RAM, a keyboard with 58 alphanumeric keys and 11 numeric keys (separate blocks), a 32-character screen, a floppy disk: capacity = 140,000 characters, of a thermal printer: speed = 28 characters / second, an asynchronous channel, asynchronous channel, a 220 V power supply. It weighed 12 kg and its dimensions were 45 × 45 × 15 cm. It provided total mobility. Its operating system was aptly named Prologue. From 1983 onward, several new input techniques were developed and included in laptops, including the touch pad (Gavilan SC, 1983), the pointing stick (IBM ThinkPad 700, 1992), and handwriting recognition (Linus Write-Top,[25] 1987). Some CPUs, such as the 1990 Intel i386SL, were designed to use minimum power to increase battery life of portable computers and were supported by dynamic power management features such as Intel SpeedStep and AMD PowerNow! in some designs." ,
       "ImgURL" : "https://pakistanijournal.com/wp-content/uploads/2020/07/Add-a-heading.jpg" ,
       "subTitle": "History"
    },

    {
        "id": 3,
        "title": "Tablets ",
        "description": " A tablet, commonly shortened to tablet, is a mobile device, typically with a mobile operating system and touchscreen display processing circuitry, and a rechargeable battery in a single, thin and flat package. Tablets, have similar capabilities, but lack some input/output abilities that others have. Modern tablets largely resemble modern smartphones, the only differences being that tablets are relatively larger than smartphones",
        "content": " The company was founded by Magnus Wanberg and started product development in Oslo in early 2014. It has collaborated with Taiwanese company E Ink.[7] Development was started in 2013[8] and a crowdfunding campaign launched in late 2016.[9] Pre-orders began in 2017.[10] Second generation reMarkable 2 was announced on March 17, 2020.[11] It was marketed as the 'World's Thinnest Tablet' (measuring 187 x 246 x 4.7 mm[12]) and sold in August 2020 for US$399 (EUR€337), not including the marker. ReMarkable uses its own operating system, named Codex. Codex is based on Linux and optimized for electronic paper display technology.[14] Community support As Codex is based on Linux and an open source ecosystem, it has gained community projects and 3rd party software for it. The device is accessible through SSH, allowing the installation of 3rd party software.[15] Many packages are accessible through Toltec, a community-maintained free software repository.[16] The Cloud system has been reverse engineered and an open source alternative has been created.[17]  Alternative operating systems An alternative free operating system, Parabola-rM, has been made to replace Codex.[18] Parabola-rM aims to turn the device into a full-fledged computer, allowing typical desktop Linux applications to be run.,[19] with the caveat that this is not a supported configuration. Subscription: In October 2021 a connect plan was launched which required a monthly subscription of $5 for its Connect Lite plan or $8 for the Connect plan with unlimited cloud storage.[21] However this was withdrawn in September 2022 and some of the original features that were withdrawn, such as integration with file hosting services, were made available to all ReMarkable owners, with there being a single Connect plan price that was reduced to $2.99 per month.[22][23]" ,
        "ImgURL" : "https://news7g.com/wp-content/uploads/2023/01/samsung-galaxy-tab-s8-ultra.jpg",
        "subTitle": "History"
    }
]